# Python দিয়ে একটি সাধারণ গেম তৈরি করা

import random

def guess_the_number():
    print("🌟 চলুন একটি গেম খেলা যাক  🌟")
    print(" আমি একটি সংখ্যা ভাবছি ১ থেকে ১০০ এর মধ্যে। ")
    print(" আমার নাম্বারটি কত? ")
    secret_number = random.randint(1, 100)
    attempts = 0
    max_attempts = 10
    
    while attempts < max_attempts:
        print(f"\n আপনি আর {max_attempts - attempts} বার চেষ্টা করতে পারবেন ")
        
        try:
            guess = int(input("আপনার সংখ্যাটি লিখুন : "))
        except ValueError:
            print("দয়া করে একটি সংখ্যা লিখুন! ")
            continue
            
        attempts += 1
        
        if guess < secret_number:
            print("আরেকটু বড় সংখ্যা লিখুন। ")
        elif guess > secret_number:
            print("আরেকটু ছোট সংখ্যা লিখুন। ")
        else:
            print(f"🎉 স্বাগতম! 🎉 আপনি সঠিক সংখ্যাটি আনুমান করতে পেরেছেন  {attempts} বার চেষ্টা করার পর !")
            return
    
    print(f"\nগেম শেষ ! সংখ্যাটি  {secret_number}.")
    print("ভাল করার জন্য শুভকামনা রইলো !")

# গেম শুরু করুন
guess_the_number()


